app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY id LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.order("id").page(params[:page]).per(3)

INSERT INTO "posts" ("content", "created_at", "name", "published", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'Prueba1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])